// C-style comments.
// First non-comment line must be the following:
MCSkin3D Language File
// Following lines are key-value pairs, stored by the program.
// A line beginning with the pound/sharp/hash sign # are
// used internally and are not actual language pieces.
#Name=Magyar
// Version is the version of the language file - it does not
// have any effect other than identification, and does not
// need to be present.
#Version=1.0
// SuppVersion is short for Supported Version, and denotes the version in which this
// language file was made for. Any other version running this file will throw an error.
#SuppVersion=1.3
// Culture is the Windows culture ID for the language.
// This is REQUIRED to be set properly!
#Culture="hu"

// These lines are not required, they are simply for identification
// purposes.
#Author="Lithriandel"
#AuthorContact="szytamas@gmail.com"
#AuthorSite=""

// Below this are the key-value pairs; ID=String
// Note that the quotes are not required, but may be used for readability purposes.
// Language developers should use this file, and not other languages, to determine the
// context in which the string is deriving - otherwise, you may lose accuracy of your
// translation over time (see TranslationParty).
C_OK="OK"
C_CANCEL="Mégse"
// Note: M_ entries stand for "menu", and as such can include
// an ampersand (&); the ampersand denotes which character is
// the keyboard accelerator for this item.
M_FILE="&Fájl"
	M_SAVE="&Mentés"
	M_SAVEAS="M&entés másként"
	M_SAVEALL="M&ind mentése"
	M_UPLOAD="Kinézet &feltöltése..."
	M_EXIT="&Kilépés"
M_EDIT="&Szerkesztés"
	M_UNDO="&Visszavonás"
	M_REDO="&Ismét"
	M_TOOL="&Eszköz"
M_VIEW="&Nézet"
	M_MODE="Nézet &típus"
		M_PERSPECTIVE="&Perspektívikus (3D)"
		M_TEXTURE="&Textúra (2D)"
		M_HYBRID="&Hibrid"
	M_3D="&3D beállítások"
		M_ANIMATE="&Animálás"
		M_FOLLOWCUR="&Egér követése"
		M_GRASS="&Talaj"
		M_GHOST="Áttetsző &rejtett elemek"
		M_MULTISAMPLING="&Élsimítás"
	M_2D="&2D beállítások"
		M_ALPHACHECKER="&Átlátszósági (alpha) tábla"
		M_OVERLAY="&Segédkeret"
			M_ENABLEOVERLAY="&Engedélyezve"
	M_TRANSMODE="Át&látszósági mód"
		M_OFF="&Ki"
		M_HELMETONLY="Csak &sisak"
		M_ALL="&Mind"
	M_VISIBLEPARTS="&Látható elemek"
		M_HEAD="&Fej"
		M_HELMET="&Sisak"
		M_CHEST="&Test"
		M_LEFTARM="B&al kar"
		M_RIGHTARM="J&obb kar"
		M_LEFTLEG="&Bal láb"
		M_RIGHTLEG="&Jobb láb"
M_OPTIONS="&Beállítások"
	M_KEYSHORTCUTS="&Billentyű parancsok"
	M_BGCOLOR="&Háttérszín"
M_LANGUAGE="&Nyelv"
M_HELP="&Súgó"
	M_CHECKUPDATES="&Frissítések keresése"
	M_AUTOUPDATE="Frissítések keresése &automatikusan"

T_TREE_ZOOMOUT="Kicsinyítés"
T_TREE_ZOOMIN="Nagyítás"
T_TREE_IMPORTHERE="Betöltés ide..."
T_TREE_NEWFOLDER="Mappa létrehozása itt..."
T_TREE_RENAME="Átnevezés..."
T_TREE_DELETE="Törlés..."
T_TREE_CLONE="Duplikálás"
T_TREE_UPLOAD="Feltöltés"

T_SAVE="Mentés"
T_SAVEALL="Mind mentése"
T_UNDO="Visszavonás"
T_REDO="Ismét"
T_PERSPECTIVE="Perspektívikus (3D)"
T_TEXTURE="Textúra (2D)"
T_HYBRID="Hibrid"
T_SCREENSHOT="Képernyőfelvétel (mentéshez tartsd lenyomva a Shift gombot)"
T_TOGGLEHEAD="Fej kapcsolása"
T_TOGGLEHELMET="Sisak kapcsolása"
T_TOGGLECHEST="Test kapcsolása"
T_TOGGLELEFTARM="Bal kar kapcsolása"
T_TOGGLERIGHTARM="Jobb kar kapcsolása"
T_TOGGLELEFTLEG="Bal láb kapcsolása"
T_TOGGLERIGHTLEG="Jobb láb kapcsolása"
T_SWATCHES="Színskála"

M_IMPORT_HERE="&Betöltés ide..."
M_NEWFOLDER_HERE="&Mappa létrehozása itt..."
M_RENAME="Át&nevezés..."
M_DELETE="&Törlés..."
M_CLONE="&Duplikálás"

T_TOOL_CAMERA="Kamera"
T_TOOL_PENCIL="Ceruza"
T_TOOL_ERASER="Radír"
T_TOOL_DROPPER="Mintavevő"
T_TOOL_DODGEBURN="Dodge/Burn"
T_TOOL_DARKENLIGHTEN="Sötétít/Világosít"
T_TOOL_BUCKET="Kitölt"
T_TOOL_NOISE="Zaj"

B_MSG_DIRMISSING="Egy mappa hiányzik - általában ennek az oka, hogy nem tömörítetted ki a programot. A program így is használható, viszont nem lesznek elérhetők a példa fájlok és a szín paletták."
B_MSG_UPTODATE="Ez a legfrissebb és legjobb verzió! Nincs újabb!"
B_MSG_NEWUPDATE="Új frisítés elérhető! Szeretnéd megnyitni a fórum bejegyzést a letöltéshez?"
B_MSG_UPLOADERROR="Hiba történt a kinézet feltöltése közben:"
B_MSG_UPLOADSUCCESS="Kinézet feltöltése sikerült! Jó szórakozást!"
B_MSG_DELETESKIN="Biztos, hogy végleg törölni akarod a kinézetet?\r\nEz törli a kinézetet a Skins mappából!"
B_MSG_DELETEFOLDER="Biztos, hogy végleg törölni akarod a mappát?\r\nEz törli a mappát és annak teljes tartalmát a Skins mappából!"
B_MSG_OVERLAYERROR="Segédkeret betöltése sikertelen: "{0}"; Biztos hogy a felbontás kettő hatványa?"
B_MSG_UPLOADRES="Bár az MCSkin3D támogatja a nagy felbontású kinézetek szerkesztését, de azt nem lehet feltölteni a profilodba."
B_MSG_ANTIALIAS="Az élsimítás módosítáasinak éltebe lépéséhez újra klell indítani az MCEdit3D programot."
B_MSG_PIXELFORMAT="Sajnáljuk, de a videó kártyád nem támogatja a 32 bites színmélységet. Jelenleg az MCEdit3D működéséhez ez elengedhetetlen. A 16/24 bites színmélység támogatása egy későbbi időpontban lesz elérhető."
B_MSG_SHORTCUTEXISTS="A {0} parancsnak ugyanaz a gyorsbillentyűje, mint a(z) {1} parancsnak. Gyorsbillentyű hozzárendelés törlölve."

B_CAP_QUESTION="Kérdés"
B_CAP_SORRY="Bocsánat"

C_SQUARE="Négyzet"
C_CIRCLE="Kör"

O_EXPOSURE="Expozíció:"
O_INCREMENTAL="Növekvő"
O_LIGHTEN="Világosít"
O_DARKEN="Sötétít"
O_DODGE="Dodge"
O_BURN="Burn"
Q_THRESHOLD="Érzékenység:"

C_NEW="Új"
C_CANTMOVE="Nem lehet áthelyezni ide:"
C_COPYTO="Másolás ide"
C_MOVETO="Áthelyezés ide"
C_IMPORTTO="Betöltés ide"

C_SETTINGSFAILED="A beállítás fájl betöltése sikertelen, a program az alapbeállításokat használja!"

C_AUTOLOGIN="Automatikus bejelentkezés"
C_REMEMBER="Emlékezz rám"
C_USERNAME="Felhasználónév:"
C_PASSWORD="Jelszó:"
C_UPLOADTEXT="A kinézet feltöltéséhez be kell jelentkezned a Minecraft.net honlapon. A program automatizálni tudja ezt a felhasználóneved és jelszavad megadásával."

C_UPLOADING="Kérem várjon! Kinézet feltöltése..."
C_SHORTCUTINUSE="A gyorbillentyű már használatban van: "

S_TREEVIEW_ZOOMIN="Kinézet lista nagyítása"
S_TREEVIEW_ZOOMOUT="Kinézet lista kicsinyítése"
S_SWATCH_ZOOMIN="Paletta nagyítása"
S_SWATCH_ZOOMOUT="Paletta kicsinyítése"
S_COLORSWAP="Előtér és háttér színek cseréje"
S_RENAME="Név módosítása"
S_CLONE="Struktúra duplikálása"
S_DELETE="Struktúra törlése"
S_SCREENSHOT_CLIP="Képernyőkép másolása"
S_SCREENSHOT_SAVE="Képernyőkép közvetlen mentése"
S_TOGGLEVIEW="Nézet váltása"
S_TOGGLETRANS="Átlátszóság váltása"

M_SHORTCUTS="Kattints a beviteli mezőbe és nyomd le a parancshoz hozzárendelni kívánt billentyű(ke)t."

T_CAMERA="Forgatás: bal egérgomb. Nagyítás: egér görgő/jobb egérgomb."
T_PENCIL="Rajzolás: bal egérgomb. Rajzolás háttérszínnel: Shift + bal egérgomb. Forgatás/nagyítás: jobb-/középső egérgomb."
T_DROPPER="Szin kiválaszátsa: bal egérgomb. Háttérszín kiválasztása: Shift + bal egérgomb. Forgatás/nagyítás: jobb-/középső egérgomb."
T_DODGEBURN="Dodge/burn: bal egérgomb. Eszköz váltás: Shift gombbal. Forgatás/nagyítás: jobb-/középső egérgomb."
T_DARKENLIGHTEN="Világosítás/sötétítés: bal egérgomb. Eszköz váltás: Shift gombbal. Forgatás/nagyítás: jobb-/középső egérgomb."
T_ERASER="Szín és átlátszóság tölése: bal egérgomb. Forgatás/nagyítás: jobb-/középső egérgomb."
T_FILL="Kitöltés: bal egérgomb. Háttérszín használata: Shift + bal egérgomb. Alkalmazás egy elemen: Ctrl + egérgomb. Forgatás/nagyítás: jobb-/középső egérgomb."
T_NOISE="Zaj alkalmazása a bal egérgomb. Forgatás/nagyítás: jobb-/középső egérgomb."

C_UNSAVED="Vannak még mentetlen változtatások! Biztos, hogy ki akarsz lépni?"
C_UNSAVED_CAPTION="Figyelem!"

O_HOLDNESS="Erősség:"

G_BRUSH="Méret"
G_BRUSHOPTS="Beállítások"
G_NOISEOPTS="Beállítások"
G_FILLOPTS="Beállítások"
G_TOOL="Eszköz"

T_DECRES="Felbontás csökkentése"
T_INCRES="Felbontás növelése"

M_NEWSKIN_HERE="Új kinézet létrehozása itt"

M_SKINERROR="A kinézet letöltése a Minecraft tárolóból sikertelen!"
M_FETCH_NAME="Letöltés a Minecraftból"
M_FETCH_TEXT="Az MCSkin3D képes letölteni a Te vagy bárki más kinézetedet a Minecraft név alapján. Add meg a Minecraft nevet amihez tartozó kinézetet le akarod tölteni, majd kattints az Imort gombra!"
M_PLAYER_NAME="Minecraft név:"

C_YES="Igen"
C_NO="Nem"
D_DONTASK="Ne kérdezze újra"
M_IRREVERSIBLE="Ez a folyamat visszafordíthatatlan és az előzmány adatok törlésével jár. Biztos, hogy folytatni kívánod?"